app/Controllers/AuthController.php

INSERT INTO `users` (`username`, `email`, `password`) VALUES ('siva', 'siva@mailinator.com', '$2y$10$MTbSlkCxvBPAFemUxaLoUOIZyMhvd2HA7wkD5z9.D2OI.7e0N4DXm')
---
    public function register()
    {
        helper(['form', 'url']);

        if ($this->request->getMethod() == 'POST') {
            $validation = \Config\Services::validation();
            $validation->setRules([
                'username' => 'required|min_length[3]|max_length[100]',
                'email'    => 'required|valid_email|is_unique[users.email]',
                'password' => 'required|min_length[6]',
            ]);

            if (!$validation->withRequest($this->request)->run()) {
                return view('register', ['validation' => $validation]);
            }

            $userModel = new UserModel();
            $userModel->save([
                'username' => $this->request->getPost('username'),
                'email'    => $this->request->getPost('email'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            ]);

SELECT *
FROM `users`
WHERE `email` = 'siva@mailinator.com'
 LIMIT 1
---
    public function login()
    {
        helper(['form', 'url']);

        if ($this->request->getMethod() == 'POST') {
            $userModel = new UserModel();
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $user = $userModel->where('email', $email)->first();